; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-7)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	)
(:init
	(at plane1 city5)
	(= (capacity plane1) 2347)
	(= (fuel plane1) 791)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 3)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 7)
	(at plane2 city0)
	(= (capacity plane2) 10144)
	(= (fuel plane2) 511)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 9)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 7)
	(at plane3 city4)
	(= (capacity plane3) 4375)
	(= (fuel plane3) 1588)
	(= (slow-burn plane3) 2)
	(= (fast-burn plane3) 5)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 6)
	(at plane4 city2)
	(= (capacity plane4) 3090)
	(= (fuel plane4) 214)
	(= (slow-burn plane4) 1)
	(= (fast-burn plane4) 3)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 1)
	(at plane5 city3)
	(= (capacity plane5) 2412)
	(= (fuel plane5) 978)
	(= (slow-burn plane5) 1)
	(= (fast-burn plane5) 3)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 5)
	(at person1 city0)
	(at person2 city0)
	(at person3 city1)
	(at person4 city3)
	(at person5 city1)
	(at person6 city1)
	(at person7 city1)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 838)
	(= (distance city0 city2) 849)
	(= (distance city0 city3) 522)
	(= (distance city0 city4) 654)
	(= (distance city0 city5) 656)
	(= (distance city1 city0) 838)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 638)
	(= (distance city1 city3) 968)
	(= (distance city1 city4) 633)
	(= (distance city1 city5) 911)
	(= (distance city2 city0) 849)
	(= (distance city2 city1) 638)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 510)
	(= (distance city2 city4) 960)
	(= (distance city2 city5) 907)
	(= (distance city3 city0) 522)
	(= (distance city3 city1) 968)
	(= (distance city3 city2) 510)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 997)
	(= (distance city3 city5) 844)
	(= (distance city4 city0) 654)
	(= (distance city4 city1) 633)
	(= (distance city4 city2) 960)
	(= (distance city4 city3) 997)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 554)
	(= (distance city5 city0) 656)
	(= (distance city5 city1) 911)
	(= (distance city5 city2) 907)
	(= (distance city5 city3) 844)
	(= (distance city5 city4) 554)
	(= (distance city5 city5) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city4)
	(at person1 city0)
	(at person2 city5)
	(at person4 city2)
	(at person5 city4)
	(at person6 city3)
	(at person7 city3)
	))

(:metric minimize (+ (* 4 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (fly plane1 city5 city4)
   deleted: (at plane1 city5)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 0 to 554, (fuel plane1) from 791 to 237
   goals met: 2 of 7
2. (board person4 plane5 city3)
   deleted: (at person4 city3)
   added: (in person4 plane5)
   changed: (onboard plane5) from 0 to 1
   goals met: 2 of 7
3. (board person2 plane2 city0)
   deleted: (at person2 city0)
   added: (in person2 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 2 of 7
4. (refuel plane2 city0)
   changed: (fuel plane2) from 511 to 10144
   goals met: 2 of 7
5. (fly plane2 city0 city5)
   deleted: (at plane2 city0)
   added: (at plane2 city5)
   changed: (total-fuel-used) from 554 to 3178, (fuel plane2) from 10144 to 7520
   goals met: 2 of 7
6. (debark person2 plane2 city5)
   deleted: (in person2 plane2)
   added: (at person2 city5)
   changed: (onboard plane2) from 1 to 0
   goals met: 3 of 7
7. (fly plane5 city3 city2)
   deleted: (at plane5 city3)
   added: (at plane5 city2)
   changed: (total-fuel-used) from 3178 to 3688, (fuel plane5) from 978 to 468
   goals met: 3 of 7
8. (debark person4 plane5 city2)
   deleted: (in person4 plane5)
   added: (at person4 city2)
   changed: (onboard plane5) from 1 to 0
   goals met: 4 of 7
9. (fly plane2 city5 city1)
   deleted: (at plane2 city5)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 3688 to 7332, (fuel plane2) from 7520 to 3876
   goals met: 4 of 7
10. (board person5 plane2 city1)
   deleted: (at person5 city1)
   added: (in person5 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 4 of 7
11. (board person6 plane2 city1)
   deleted: (at person6 city1)
   added: (in person6 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 4 of 7
12. (board person7 plane2 city1)
   deleted: (at person7 city1)
   added: (in person7 plane2)
   changed: (onboard plane2) from 2 to 3
   goals met: 4 of 7
13. (fly plane2 city1 city3)
   deleted: (at plane2 city1)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 7332 to 11204, (fuel plane2) from 3876 to 4
   goals met: 4 of 7
14. (debark person6 plane2 city3)
   deleted: (in person6 plane2)
   added: (at person6 city3)
   changed: (onboard plane2) from 3 to 2
   goals met: 5 of 7
15. (debark person7 plane2 city3)
   deleted: (in person7 plane2)
   added: (at person7 city3)
   changed: (onboard plane2) from 2 to 1
   goals met: 6 of 7
16. (refuel plane2 city3)
   changed: (fuel plane2) from 4 to 10144
   goals met: 6 of 7
17. (fly plane2 city3 city4)
   deleted: (at plane2 city3)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 11204 to 15192, (fuel plane2) from 10144 to 6156
   goals met: 6 of 7
18. (debark person5 plane2 city4)
   deleted: (in person5 plane2)
   added: (at person5 city4)
   changed: (onboard plane2) from 1 to 0
   goals met: 7 of 7
